In [181]:
# 모듈 로딩
import pandas as pd
import numpy as np
import math
PATH = '../DATA/'
FILE= PATH + 'tItanic.csv'
df=pd.read_csv(FILE)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [182]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [183]:
df['Age'].isnull().sum()

177

In [184]:
df['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [185]:
# 중복 체크
df.duplicated().sum()

0

# [ 1. 결측치 제거 : Age, Cabin,Embarked ]

## ● Age 결측치 제거

In [186]:
# Age 결측치 -> 전체 평균 나이로 치환
df['Age'].fillna(df['Age'].mean(),inplace=True)

In [187]:
# 결측치 여부 확인 : 0
df['Age'].isnull().sum()

0

In [188]:
# float 타입을 int로 변환 
df['Age']= df['Age'].astype('int')

In [189]:
# 0 을 1로 변환 
df['Age'].replace(0,1,inplace=True)

In [190]:
# Age 요소 확인.
df['Age'].unique()

array([22, 38, 26, 35, 29, 54,  2, 27, 14,  4, 58, 20, 39, 55, 31, 34, 15,
       28,  8, 19, 40, 66, 42, 21, 18,  3,  7, 49, 65,  5, 11, 45, 17, 32,
       16, 25,  1, 30, 33, 23, 24, 46, 59, 71, 37, 47, 70, 12,  9, 36, 51,
       44, 61, 56, 50, 62, 41, 52, 63, 43, 60, 10, 64, 13, 48, 53, 57, 80,
        6, 74])

## ● Embarked 결측치 제거

In [191]:
# Embarked 결측치 확인
df['Embarked'].isnull().sum()

2

In [192]:
# Embarked 데이터 확인
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [193]:
# Embarked 결측치 공백으로 치환
df['Embarked'].fillna("",inplace=True)

In [194]:
# Embarked 결측치 제거 확인
df['Embarked'].isnull().sum()

0

## ● Cabin 결측치 제거

In [195]:
# Cabin 결측치 확인 : 너무 많아서 삭제
df['Cabin'].isnull().sum()

687

In [196]:
df.drop('Cabin',axis=1,inplace= True)

# [ 2. 타입 변환 : Pclass,Sex, Embarked ]

In [197]:
# 탑승클래스, 성별, 출발지는 범주형 데이터로 Category 형태로 변환
df['Pclass']=df['Pclass'].astype('category')
df['Pclass']=df['Sex'].astype('category')
df['Pclass']=df['Embarked'].astype('category')

# [ 3. 각 요소와 생존의 상관관계 찾기]

In [198]:
# 생존 분류
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [199]:
# 탑승클래스 데이터 분류
df['Pclass'].value_counts()

S    644
C    168
Q     77
       2
Name: Pclass, dtype: int64

In [200]:
# 성별 데이터
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [201]:
df['Survived'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Survived
Non-Null Count  Dtype
--------------  -----
891 non-null    int64
dtypes: int64(1)
memory usage: 7.1 KB

In [202]:
# 출발지역 분류
df['Embarked'].value_counts()

S    644
C    168
Q     77
       2
Name: Embarked, dtype: int64

In [203]:
df[df['Survived']==1  ]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,2,1,C,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C
2,3,1,S,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,S
3,4,1,S,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,S
8,9,1,S,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,S
9,10,1,C,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,C
...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,C,"Najib, Miss. Adele Kiamie ""Jane""",female,15,0,0,2667,7.2250,C
879,880,1,C,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56,0,1,11767,83.1583,C
880,881,1,S,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25,0,1,230433,26.0000,S
887,888,1,S,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,S
889,890,1,C,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C

In [209]:
# 여성 생존
df_1_female=df[ (df['Survived']==1) & (df['Sex']=='female' ) ]
df_1_female.count()

PassengerId    233
Survived       233
Pclass         233
Name           233
Sex            233
Age            233
SibSp          233
Parch          233
Ticket         233
Fare           233
Embarked       233
dtype: int64

In [211]:
# 여성 사망
df_0_female=df[ (df['Survived']==0) & (df['Sex']=='female' ) ]
df_0_female.count()

PassengerId    81
Survived       81
Pclass         81
Name           81
Sex            81
Age            81
SibSp          81
Parch          81
Ticket         81
Fare           81
Embarked       81
dtype: int64

In [213]:
# 남성 생존
df_1_male=df[ (df['Survived']==1) & (df['Sex']=='male'  ) ]
df_1_male.count()

PassengerId    109
Survived       109
Pclass         109
Name           109
Sex            109
Age            109
SibSp          109
Parch          109
Ticket         109
Fare           109
Embarked       109
dtype: int64

In [212]:
# 남성 사망
df_1_female=df[ (df['Survived']==0) & (df['Sex']=='male'  ) ]
df_1_female.count()

PassengerId    468
Survived       468
Pclass         468
Name           468
Sex            468
Age            468
SibSp          468
Parch          468
Ticket         468
Fare           468
Embarked       468
dtype: int64

In [208]:
df_Survived_Sex.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 342 entries, 1 to 889
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  342 non-null    int64
 1   Survived     342 non-null    int64
 2   Pclass       342 non-null    int64
 3   Name         342 non-null    object
 4   Sex          342 non-null    object
 5   Age          342 non-null    int32
 6   SibSp        342 non-null    int64
 7   Parch        342 non-null    int64
 8   Ticket       342 non-null    object
 9   Fare         342 non-null    float64
 10  Embarked     342 non-null    object
dtypes: float64(1), int32(1), int64(5), object(4)
memory usage: 30.7+ KB